Repository: getupcloud/getupcloud.github.io
Catalog: locale/*/LC_MESSAGES/site.po
Languages: pt_br

source: Getup is a scalable cloud application platform.
pt_br: Getup é uma plataforma para hospedagem na nuvem

source: GETUP IS A
pt_br: Getup é uma

source: SCALABLE CLOUD
pt_br: plataforma para

source: APPLICATION
pt_br: hospedagem

source: PLATFORM
pt_br: na nuvem

source: AUTO SCALE
pt_br: AUTO ESCALÁVEL

source: Compute power when you need it most.
pt_br: Recursos disponíveis na hora que você mais precisa.

source: Compare benefits and price
pt_br: Compare os benefícios e valores

source: Deploy your application in minutes
pt_br: Publique sua aplicação em minutos

source: Application
pt_br: Aplicação

source: See more
pt_br: Veja mais

source: With auto-scale you don't need to worry about growth, don't get caught by traffic spikes.
pt_br: Com a escalabilidade é automática você não precisa se preocupar com crescimento, mesmo que aconteça do dia para a noite.

source: Getup is the best hosting option for those who do not want to waste time setting up servers.
pt_br: A Getup é a melhor opção de hospedagem para quem não quer perder tempo configurando servidores.

source: An application can run using one or more gears and the amount will be determined by the volume of access.
pt_br: Uma aplicação poderá rodar usando um ou mais gears e a quantidade será determinada pelo volume de acessos.

source: The monthly cost is calculated by the number of gears used and the number of hours that each gear were active.
pt_br: Já o valor mensal é calculado através do número de gears utilizados e o número de horas em que ficaram ativos.

source: Compare Getup with other services for a month with a traffic peak as an example
pt_br: Compare Getup com outros serviços durante um mês com um Pico de acesso como exemplo.

source: Check it out.
pt_br: Confira

source: An easy and fast way to build and deploy web apps.
pt_br: Uma forma fácil e rápida de desenvolver e publicar aplicações web.

source: You only have to worry about coding your app - we take care of everything else.
pt_br: Você se preocupa com o código - nós cuidamos do resto.

source: what
pt_br: o que

source: how it works
pt_br: como funciona

source: pricing
pt_br: preço

source: get in touch
pt_br: contato

source: support
pt_br: suporte

source: Sign up
pt_br: Crie sua conta

source: simple steps to deploy your app
pt_br: simples passos para o deploy

source: Overview
pt_br: Visão geral

source: Create Application
pt_br: Crie

source: Deploy
pt_br: Publique

source: Scale
pt_br: Escale

source: Security
pt_br: Segurança

source: Have a beer!
pt_br: Pegue sua cerveja

source: Create and deploy web-based applications without the cost and complexity of buying and managing servers.
pt_br: Crie e publique aplicações web sem o custo e a complexidade de comprar e administrar servidores.

source: With Getup you pay only
pt_br: Na Getup voce paga

source: for what you use
pt_br: apenas pelo que usou

source: and saves time.
pt_br: e ainda economiza tempo

source: With getup you only need to manage:
pt_br: Na Getup você só precisa gerenciar:

source: Any CMS
pt_br: Seu CMS

source: Your Code/Scripts
pt_br: Seu Código/Scripts

source: Your Applications
pt_br: Suas Aplicações

source: And we do all the rest:
pt_br: E nós fazemos o resto

source: Servers
pt_br: Servidores

source: Network
pt_br: Rede

source: Redundance
pt_br: Redundância

source: Scalability
pt_br: Escalabilidade

source: Operating Systems
pt_br: Sistema Operacional

source: Launch in an easy
pt_br: Publique e escale

source: Our platform manages the entire application life-cycle.
pt_br: Nossa plataforma gerencia todo o ciclo de vida da aplicação.

source: Once deployed, it will take care of all the components, utilization spikes and scalability.
pt_br: Uma vez publicada, a plataforma cuida de todos os componentes, picos de utilização e escalabilidade.

source: Servers, storage, load balancer?
pt_br: Servidores, storage, load balancer?

source: Forget about this crap. We'll do all that boring stuff for you!
pt_br: Esqueça a parte chata. Nós faremos a parte boring para você!

source: Technology
pt_br: Tecnologia

source: Choose the technology of your app - PHP, Ruby, Python, Node.js
pt_br: Escolha a tecnologia da aplicação - PHP, Ruby, Python, Node.js

source: Or choose an application from our Fast Start App repo
pt_br: Ou escolha uma aplicação em nosso Fast Start APP

source: We take care of scale so you don't need to worry about traffic spikes and scalability complexity.
pt_br: Nós cuidamos da escalabilidade para que você não precise se preocupar com picos de tráfego e com a complexidade envolvida.

source: All applications are up and running on your own URL with shared SSL by default.
pt_br: Todas as aplicações rodam com uma URL própria e um certificado SSL compartilhado.

source: Add components to your app through cartridges like MySQL, PHPMyAdmin, PostgreSQL, Ruby, PHP, Django.
pt_br: Adicione componentes na aplicação através dos cartridges como MySQL, PHPMyAdmin, PostgreSQL, Ruby, PHP, Django.

source: You can add a cartridge using our powerful Web Console or CLI
pt_br: Você pode adicionar um cartridge usando o Console WEB ou CLI

source: Just type 'git push' and voil&aacute;! Your application is up and running!
pt_br: Digite 'git push' e voil&aacute;! Sua aplicação está up and running!

source: Development life-cycle
pt_br: Ciclo de vida do desenvolvimento

source: Warp-speed and too-damn-easy swapping to work with test, stage or production versions of your app.
pt_br: Trabalhe e mude a versão da sua aplicação entre teste, stage e produção em warp-speed.

source: Add a database just adding a new cartridge.
pt_br: Adicione um banco de dados adicionando um cartridge.

source: Your app set in one or more gears - as many as you want or your application requests demand.
pt_br: Sua aplicação em um ou mais gears - quantos você quiser ou quantos forem necessários para atender as requisições.

source: Forget servers, network, firewall or virtual machines.
pt_br: Esqueça servidores, rede, firewall ou VM's.

source: Scaling
pt_br: Escalabilidade

source: Don't get caught by traffic spikes. Auto-scaling enables your application to react to them without the pain in the neck of dealing with load balancers, replication and others things.
pt_br: Não seja pego pelos picos de tráfego. A escalabilidade automática permite que sua aplicação reaja aos picos sem a dor de cabeça de ter de lidar com load balancer, replicação e outros detalhes.

source: When you create or scale an application, you pay by hour usage, for what you use and only for the running applications - nothing more, nothing less.
pt_br: Quando você cria ou escala uma aplicação, você paga por hora de uso, apenas pelo período que usou - nada mais, nada menos.

source: It's more efficient and versatile than traditional computing.
pt_br: É mais eficiente e versátil que os modelos tradicionais de hosting.

source: Monitor
pt_br: Monitoramento

source: Getup monitors all incoming web traffic across the gears and automatically brings new copies of your gears to handle requests.
pt_br: Na Getup monitoramos todo tráfego web de entrada e criamos novas cópias dos seus gears para suportar o volume de requisições.

source: Remember warp-speed? Just lean back and enjoy the ride.
pt_br: Lembra do warp-speed? É reclinar na poltrona e curtir o passeio.

source: Getup is built on the Red Hat OpenShift Platform and runs Red Hat Enterprise Linux OS (RHEL), one of the most respected Linux distributions. The security layer is guaranteed by SELinux, which acts as a "firewall" among customers' applications.
pt_br: Getup utiliza a plataforma Red Hat Openshift e roda Red Hat Enterprise Linux (RHEL), uma das mais respeitadas distribuições Linux. A camada de segurança é garantida pelo SELinux, que atua como um "firewall" entre as aplicações dos usuários.

source: Workload distribution and redundancy
pt_br: Distribuído e Redundante

source: Our infrastructure is distributed across multiple servers, spread in multiple Amazon AZ (Availability Zones).
pt_br: Nossa infraestrutura está distribuída através de múltiplos servidores, espalhados em múltiplas Amazon AZ's (Availability Zones).

source: If one server or one Availability Zone fails, the affected applications can be moved to another server or another AZ.
pt_br: Se um servidor ou uma AZ entrar em falha, as aplicações afetadas podem ser movidas para outro servidor ou outra AZ.

source: That's it.
pt_br: É só isso. Mesmo.

source: If you don't care too much for the liquid gold, do whatever you want with your
pt_br: Agora se você não liga para o néctar dourado, faça o que você quiser com seu

source: spare time. Told you it was six simple steps, right? ;)
pt_br: tempo livre. Como dissemos, são simples passos, certo? ;)

source: Included
pt_br: Incluso

source: Support
pt_br: Suporte

source: Ticket, Forum, Community
pt_br: Ticket, Fórum, Comunidade

source: Shared SSL included
pt_br: SSL compartilhado incluso

source: Additional Storage
pt_br: Storage adicional

source: month
pt_br: mês

source: API requests
pt_br: Requisições de API

source: Unlimited
pt_br: ilimitadas

source: hour
pt_br: hora

source: First Step
pt_br: PRIMEIRO PASSO

source: What's your name
pt_br: Qual seu nome

source: What's your e-mail
pt_br: Qual seu e-mail

source: Password
pt_br: Senha

source: Confirm password
pt_br: Confirme a senha

source: Promo code (optional)
pt_br: Código promocional (opcional)

source: Almost finished...
pt_br: Quase lá...

source: You're just a few clicks away.
pt_br: Você está a alguns cliques.

source: To complete the process, please click the link in the email we just sent you.
pt_br: Para completar, clique no email que acabamos de enviar.

source: A few examples of applications running on Getup
pt_br: Alguns exemplos de aplicações rodando na plataforma

source: An application will run in one or more gears and the number will be determined by amount of traffic - users accessing your application.
pt_br: A aplicação poderá rodar usando um ou mais gears e a quantidade será determinada pelo volume de acessos.

source: The monthly fee is calculated by the number of gears used and the number of hours that they were active.
pt_br: Já o valor mensal é calculado através do número de gears utilizados e número de horas em que ficaram ativos.

source: To help you understand and get an estimated cost, we created a reference chart with 3 types of application.
pt_br: Para auxiliá-lo na estimativa de custo criamos uma tabela de referência para 3 tipos de aplicações.

source: PHP Application
pt_br: Aplicação PHP

source: pages per second
pt_br: páginas por segundo

source: Application like our website
pt_br: Aplicação como nosso site

source: Static HTML with 30KB image
pt_br: Estático com uma imagem de 30KB

source: Estimated costs assume the maximum number of gears running continuously for an entire month.
pt_br: A estimativa de gasto considera os gears rodando continuamente por um mês inteiro. Este valor deverá ser menor, pois o mais comum é que picos de utilização durem apenas algumas horas.

source: Gear is a resource constrained container which allows users to run their application. It's like a server on the cloud ;) Each gear has 512MB RAM and 1GB storage. If one application needs more resources, it can use multiple gears - that scalability thing.
pt_br: Gear é um contâiner com uma quantidade específica de recursos e permite aos usuários rodarem suas aplicações. Pense no gear como um servidor na nuvem ;) O Gear possui 512Mb RAM e 1GB de disco. Se uma aplicação precisar de mais recursos, ela poderá usar múltiplos gears, o que chamamos de escalabilidade.

source: Scalability - What it is and how it works
pt_br: Escalabilidade - o que é e como funciona:

source: Scalability empowers your application with traffic management automation, extending and reducing the capacity by adding and removing gears on demand.
pt_br: A escalabilidade permite que sua aplicação atenda qualquer volume de acessos, ampliando e reduzindo a capacidade, criando e removendo gears conforme a demanda.

source: Some gears can be temporary, as your demand is, so you pay only for the time that each gear is running. You can also set the max number of gears that your application uses - that's financial control.
pt_br: Os gears criados temporariamente para atender os picos de acesso são cobrados por hora de utilização, você paga apenas pelo período em que ficaram ativos e você determina o número máximo de gears que serão criados - mais controle sobre os gastos.

source: Let's talk
pt_br: Venha conversar

source: about clouds.
pt_br: sobre nuvem.

source: Our Infrastructure is based on:
pt_br: Nossa infraestrutura é baseada em:

source: US$ 0,935/GB/Month
pt_br: R$ 1,87/GB/Mês

source: US$ 0,074/hour
pt_br: R$ 0,156/hora

source: USD
pt_br: BRL

source: US$
pt_br: R$

source: Monthly cost
pt_br: Custo Mensal

source: US$ ~54,23
pt_br: R$ ~113,88

source: I read and agree to the
pt_br: Li e aceito os

source: Terms of use
pt_br: Termos de uso

source: Privacy policy
pt_br: Política de privacidade

source: Acceptable use policy
pt_br: Política de utilização aceitável - PUA

source: Support policy
pt_br: Política de suporte
